{
    "type":"BaseLoader",
    "message":{
        "telegram_error":{
            "generic":{
                "it":"Si è verificato un errore durante l'elaborazione della richiesta. Per favore riprova più tardi.",
                "en":"An error occurred while processing your request. Please try again later."
            }
        },
        "generic_error":{
            "generic":{
                "it":"Si è verificato un errore imprevisto. Per favore riprova più tardi.",
                "en":"An unexpected error occurred. Please try again later."
            }
        },
        "http_client_error":{
            "generic":{
                "it": "Si è verificato un errore inaspettato. Controlla la tua connessione o riprova più tardi. Se il problema persiste, contatta il supporto.",
                "en": "An unexpected error occurred. Please check your connection or try again later. If the issue persists, contact support."
            },
            "client_response":{
                "telegram":{
                    "404": {
                        "it": "Non siamo riusciti a trovare quello che stai cercando. La pagina o l'elemento richiesto potrebbe non esistere. Prova una ricerca diversa o riprova più tardi.",
                        "en": "We couldn't find what you're looking for. The requested page or item might not exist. Please try a different search or check back later."
                    },
                    "500": {
                        "it": "Ops! Qualcosa è andato storto dal nostro lato. Il nostro team sta lavorando per risolvere il problema. Per favore, riprova più tardi.",
                        "en": "Oops! Something went wrong on our end. Our team is working on fixing this issue. Please try again later."
                    }
                }
            }
        },
        "dao_error":{
            "generic":{
                "it":"Si è verificato un errore durante il salvataggio, Per favore riprova più tardi.",
                "en":"An unexpected error occurred while saving. Please try again later."
            },
            "user_update_error":{
                "duplicated_filter_name": {
                    "it": "Hai già utilizzato questo nome per un altro filtro. Per favore, scegline un altro.",
                    "en": "You've already used this name for another filter. Please choose a different one."
                }
            },
            "user_data_not_found_error":{
                "search_param_not_found": {
                    "it": "I filtri di ricerca con il nome fornito non sono stati trovati.",
                    "en": "The search filters with the provided name were not found."
                },
                "no_search_params_saved": {
                    "it": "Nessun filtro di ricerca salvato, aggiungine uno usando il comando /add_new_search_filters",
                    "en": "No search filters saved. Add one using the command /add_new_search_filters"
                }
            }
        }
    }
}